const config = require('../config');
const { cmd } = require('../command');
const os = require("os");
const { runtime } = require('../lib/functions');
const {
  generateWAMessageContent,
  generateWAMessageFromContent
} = require('@whiskeysockets/baileys');

cmd({
  pattern: "menu2",
  react: "🥵",
  alias: ["m", "qadeer"],
  desc: "Get command list",
  category: "main",
  filename: __filename
},
async (conn, mek, m, { from, sender, reply }) => {
  try {

    const categories = [
      {
        title: "*_MAIN MENU_*",
        desc: `
*╭┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉━┈᛭*
*┇*❁╭┉┉┉┉┉┉┉┉┉┉┉━•⟢
*┇*❁┇⚘┇❀┇⚘┇❀┇⚘┇❀┇
*┇*❁┇⚘┇❀┇⚘┇❀┇⚘┇  🅡⃞
*┇*❁┇⚘┇❀┇⚘┇❀┇  🅔⃞
*┇*❁┇⚘┇❀┇⚘┇  🅔⃞
*┇*❁┇⚘┇❀┇ 🅓⃞
*┇*❁┇⚘┇  🅐⃞
*┇*❁┇ 🅠⃞
*┇*❁┇
*┇*❁┇ *᛭┉┉┉┈┈┈┈┈┈┉┉┉᛭*
*┇*❁┇ʜᴇʟʟᴏ : @${sender.split('@')[0]}
*┇*❁┇ʙᴏᴛ : ${config.BOT_NAME}
*┇*❁┇ᴍᴏᴅᴇ : ${config.MODE}
*┇*❁┇ᴜᴘᴛɪᴍᴇ : ${runtime(process.uptime())}
*┇*❁┇ᴘʟᴀᴛғᴏʀᴍ : ${os.platform()}
*┇*❁┇ᴠᴇʀsɪᴏɴ : 5.0.0
*┇*❁┇ *᛭┉┉┉┈┈┈┈┈┈┉┉┉᛭*
*┇*❁┇
*┇*❁╰┉┉┉┉┉┉┉┉┉┉┉━•⟢
*╰┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉━┈᛭*
`,
        button: {
          text: "❀ ǫᴀᴅᴇᴇʀ | ʀᴀʜᴍᴀɴ ❀",
          url: "https://whatsapp.com/channel/0029VbAkAEhCRs1g8MmyEJ2K"
        },
        image: "https://eliteprotech-url.zone.id/1783842644515tugmfr.jpg"
      },

      {
        title: "*_DOWNLOAD_*",
      desc: `
‎*╭┉┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊰*
‎*┋*✾╭┉┉┉┉┉┉┉┉┉┉━┈⊷
‎*┋*✾┋⚘┋❀┋⚘┋✾┋⚘┋✾┋
‎*┋*✾┋⚘┋❀┋⚘┋✾┋⚘┋  🅡⃞
‎*┋*✾┋⚘┋❀┋⚘┋✾┋  🅔⃞  
‎*┋*✾┋⚘┋❀┋⚘┋   🅔⃞ 
‎*┋*✾┋⚘┋❀┋  🅓⃞
‎*┋*✾┋⚘┋   🅐⃞             
‎*┋*✾┋  🅠⃞        
‎*┋*✾┋         
‎*┋*✾┋ *᛭┉┉┉┈┈┈┈┈┈┉┉┉᛭*
‎*┇*✾┋🌼󟀠⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ *_𝙳𝙾𝚆𝙽𝙻𝙾𝙰𝙳_* ⃟⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟🌼
‎*┇*✾┋ *᛭┉┉┉┈┈┈┈┈┈┉┉┉᛭*
‎*┇*✾┋. *_ғᴀᴄᴇʙᴏᴏᴋ_*
‎*┇*✾┋. *_ᴘɪɴᴛᴇʀᴇsᴛ_*
‎*┇*✾┋. *_ᴍᴇᴅɪᴀғɪʀᴇ_*
‎*┇*✾┋. *_sᴘᴏᴛɪғʏ_* 
‎*┇*✾┋. *_sᴏɴɢ_*
‎*┇*✾┋. *_ᴛɪᴋᴛᴏᴋ_* 
‎*┇*✾┋. *_ɢᴅʀɪᴠᴇ_*
‎*┇*✾┋. *_ᴍᴇɢᴀ_*
‎*┇*✾┋. *_sᴘᴏᴛɪғʏ_*
‎*┇*✾┋. *_ᴘʟᴀʏ_*
‎*┇*✾┋. *_ᴛɪᴋs_*
‎*┇*✾┋. *_ᴅʀᴀᴍᴀ_*
‎*┇*✾┋. *_ssᴡᴇʙ_*
‎*┇*✾┋. *_ᴀᴘᴋ_*
‎*┇*✾┋. *_ᴍᴇɢᴀ_*
‎*┇*✾┋. *_ᴠɪᴅᴇᴏ_*
‎*┇*✾┋. *_ɪᴍɢ_*
‎*┇*✾┋. *_ᴛɢ_*
‎*┇*✾╰┉┉┉┉┉┉┉┉┉┉━┈⊷
‎*╰┉┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊰*`,
        button: {
          text: "𝗚𝗥𝗢𝗨𝗣",
          url: "https://chat.whatsapp.com/J0Nw0Q7Qtz2GLfcPb6x5rO?s=cl&p=a&mlu=0&ilr=0&amv=0"
        },
        image: "https://eliteprotech-url.zone.id/1783842644515tugmfr.jpg"
      },

      {
        title: "*_OWNER_*",
    desc: `
‎*╭┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊰*
‎*┋*✾╭┉┉┉┉┉┉┉┉┉┉┉━┈⊷
‎*┋*✾┋⚘┋❀┋⚘┋✾┋⚘┋✾┋
‎*┋*✾┋⚘┋❀┋⚘┋✾┋⚘┋  🅡⃞
‎*┋*✾┋⚘┋❀┋⚘┋✾┋  🅔⃞  
‎*┋*✾┋⚘┋❀┋⚘┋   🅔⃞ 
‎*┋*✾┋⚘┋❀┋  🅓⃞
‎*┋*✾┋⚘┋   🅐⃞             
‎*┋*✾┋  🅠⃞        
‎*┋*✾┋         
‎*┋*✾┋ *᛭┉┉┉┈┈┈┈┈┈┉┉┉᛭*
‎*┇*✾┋🌼󟀠⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ *_𝙾𝚆𝙽𝙴𝚁_*  ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟🌼
‎*┇*✾┋*᛭┉┉┉┈┈┈┈┈┈┉┉┉᛭*
‎*┇*✾┋. *_sʜᴜᴛᴅᴏᴡɴ_*
‎*┇*✾┋. *_ᴘɪɴɢ_*
‎*┇*✾┋. *_ᴏᴡɴᴇʀ_*
‎*┇*✾┋. *_ʙʟᴏᴄᴋ_* 
‎*┇*✾┋. *_ᴜɴʙʟᴏᴄᴋ_*
‎*┇*✾┋. *_ᴀᴜᴛᴏʀᴇᴀᴄᴛ_* 
‎*┇*✾┋. *_ᴀɴᴛɪʟɪɴᴋ_*
‎*┇*✾┋. *_ᴀɴᴛɪᴅᴇʟᴇᴛᴇ_*
‎*┇*✾┋. *_ᴊɪᴅ_*
‎*┇*✾┋. *_ʀᴇᴘᴏ_*
‎*┇*✾┋. *_ʀᴜɴᴛɪᴍᴇ_*
‎*┇*✾┋. *_sᴜᴘᴘᴏʀᴛ_*
‎*┇*✾┋. *_ᴅᴇᴠ_*
‎*┇*✾┋. *_ғʀᴇɪɴᴅs_*
‎*┇*✾┋. *_ᴜᴘᴅᴀᴛᴇ_*
‎*┇*✾┋. *_sᴇᴛᴘʀᴇғɪx_*
‎*┇*✾┋. *_ᴀɴᴛɪᴄᴀʟʟ_*
‎*┇*✾┋. *_ᴜᴘᴛɪᴍᴇ_*
‎*┇*✾╰┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊷
‎*╰┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊰*`,
        button: {
          text: "𝗢𝗪𝗡𝗘𝗥",
          url: "https://wa.me/message/HNWKVGBDPE3KC1"
        },
        image: "https://eliteprotech-url.zone.id/1783842644515tugmfr.jpg"
      },

      {
        title: "*_CONVERT_*",
        desc: `
‎*╭┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊰*
‎*┋*✾╭┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊷
‎*┋*✾┋⚘┋❀┋⚘┋✾┋⚘┋✾┋
‎*┋*✾┋⚘┋❀┋⚘┋✾┋⚘┋  🅡⃞
‎*┋*✾┋⚘┋❀┋⚘┋✾┋  🅔⃞  
‎*┋*✾┋⚘┋❀┋⚘┋   🅔⃞ 
‎*┋*✾┋⚘┋❀┋  🅓⃞
‎*┋*✾┋⚘┋   🅐⃞             
‎*┋*✾┋  🅠⃞        
‎*┋*✾┋         
‎*┋*✾┋ *᛭┉┉┉┈┈┈┈┈┈┉┉┉᛭*
‎*┇*✾┋🌼󟀠⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ *_𝙲𝙾𝙽𝚅𝙴𝚁𝚃_*  ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟🌼
‎*┇*✾┋ *᛭┉┉┉┈┈┈┈┈┈┉┉┉᛭*
‎*┇*✾┋. *_sᴛɪᴄᴋᴇʀ_*
‎*┇*✾┋. *_ᴘʜᴏᴛᴏ_*
‎*┇*✾┋. *_ᴀɢᴇ_*
‎*┇*✾┋. *_ss_* 
‎*┇*✾┋. *_ᴊᴀɪʟ_*
‎*┇*✾┋. *_ʀᴍʙɢ_* 
‎*┇*✾┋. *_ᴡᴀɴᴛᴇᴅ_*
‎*┇*✾┋. *_ᴛᴏᴍᴘ𝟹_*
‎*┇*✾┋. *_ᴀᴛᴛᴘ_*
‎*┇*✾┋. *_ᴜʀʟ_*
‎*┇*✾┋. *_ᴛɪɴʏ_*
‎*┇*✾┋. *_ғᴏʀᴡᴀʀᴅ_*
‎*┇*✾┋. *_ᴀɴᴀʟʏᴢᴇ_*
‎*┇*✾┋. *_ʀᴏᴀsᴛ_*
‎*┇*✾┋. *_ᴛɢs_*
‎*┇*✾┋. *_ᴀᴅᴇ_*
‎*┇*✾┋. *_ᴛʀᴛ_*
‎*┇*✾┋. *_ᴠsᴛɪᴄᴋᴇʀ_*
‎*┇*✾╰┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊷
‎*╰┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊰*`,
        button: {
          text: "𝗚𝗖",
          url: "https://chat.whatsapp.com/J0Nw0Q7Qtz2GLfcPb6x5rO?s=cl&p=a&mlu=0&ilr=0&amv=0"
        },
        image: "https://eliteprotech-url.zone.id/1783842644515tugmfr.jpg"
      },

      {
        title: "*_AI-MENU_*",
        desc: `
‎*╭┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊰*
‎*┋*✾╭┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊷
‎*┋*✾┋⚘┋❀┋⚘┋✾┋⚘┋✾┋
‎*┋*✾┋⚘┋❀┋⚘┋✾┋⚘┋  🅡⃞
‎*┋*✾┋⚘┋❀┋⚘┋✾┋  🅔⃞  
‎*┋*✾┋⚘┋❀┋⚘┋   🅔⃞ 
‎*┋*✾┋⚘┋❀┋  🅓⃞
‎*┋*✾┋⚘┋   🅐⃞             
‎*┋*✾┋  🅠⃞        
‎*┋*✾┋         
‎*┋*✾┋ *᛭┉┉┉┈┈┈┈┈┈┉┉┉᛭*
‎*┇*✾┋🌼󟀠⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ *_𝙰𝙸-𝙼𝙴𝙽𝚄_*  ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟🌼
‎*┇*✾┋ *᛭┉┉┉┈┈┈┈┈┈┉┉┉᛭*
‎*┇*✾┋. *_ɢᴘᴛ_*
‎*┇*✾┋. *_ᴀɪ_*
‎*┇*✾┋. *_ғʟᴜxᴀɪ_*
‎*┇*✾┋. *_ᴅᴇᴇᴘsᴇᴇᴋ_* 
‎*┇*✾┋. *_ʀᴀʜᴍᴀɴ_*
‎*┇*✾┋. *_ᴍᴀɢɪᴄᴀɪ_* 
‎*┇*✾┋. *_ʀᴀʜᴍᴀɴᴀɪ_*
‎*┇*✾┋. *_ᴡᴀᴛᴇʀᴍᴀʀᴋ_*
‎*┇*✾┋. *_ɢᴇᴍɪɴɪ_*
‎*┇*✾┋. *_ᴀɪᴀʀᴛ_*
‎*┇*✾┋. *_sᴏʀᴀ_*
‎*┇*✾┋. *_ʙᴏᴛ_*
‎*┇*✾┋. *_ᴍᴇᴛᴀ_*
‎*┇*✾┋. *_ᴄʜᴀᴛʙᴏᴛ_*
‎*┇*✾┋. *_sᴛᴀʙɪʟɪᴛʏ_*
‎*┇*✾┋. *_sᴅɪғғᴜsɪᴏɴ_*
‎*┇*✾┋. *_ᴏᴘᴇɴᴀɪ_*
‎*┇*✾┋. *_ᴀɴᴀʟʏsᴇ_*
‎*┇*✾╰┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊷
‎*╰┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊰*`,
        button: {
          text: "𝗖𝗛𝗔𝗡𝗡𝗘𝗟",
          url: "https://whatsapp.com/channel/0029VbAkAEhCRs1g8MmyEJ2K"
        },
        image: "https://eliteprotech-url.zone.id/1783842644515tugmfr.jpg"
      },

      {
        title: "*_GROUP_*",
        desc: `
‎*╭┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊰*
‎*┋*✾╭┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊷
‎*┋*✾┋⚘┋❀┋⚘┋✾┋⚘┋✾┋
‎*┋*✾┋⚘┋❀┋⚘┋✾┋⚘┋  🅡⃞
‎*┋*✾┋⚘┋❀┋⚘┋✾┋  🅔⃞  
‎*┋*✾┋⚘┋❀┋⚘┋   🅔⃞ 
‎*┋*✾┋⚘┋❀┋  🅓⃞
‎*┋*✾┋⚘┋   🅐⃞             
‎*┋*✾┋  🅠⃞        
‎*┋*✾┋         
‎*┋*✾┋ *᛭┉┉┉┈┈┈┈┈┈┉┉┉᛭*
‎*┇*✾┋🌼󟀠⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ *_𝙶𝚁𝙾𝚄𝙿_* ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟🌼
‎*┇*✾┋ *᛭┉┉┉┈┈┈┈┈┈┉┉┉᛭*
‎*┇*✾┋. *_ᴋɪᴄᴋᴀʟʟ_*
‎*┇*✾┋. *_ᴋɪᴄᴋ_*
‎*┇*✾┋. *_ᴅᴇᴍᴏᴛᴇ_*
‎*┇*✾┋. *_ᴘʀᴏᴍᴏᴛᴇ_* 
‎*┇*✾┋. *_ᴛᴀɢᴀʟʟ_*
‎*┇*✾┋. *_ᴍᴜᴛᴇ_* 
‎*┇*✾┋. *_ᴜɴᴍᴜᴛᴇ_*
‎*┇*✾┋. *_ʟᴇᴀᴠᴇ_*
‎*┇*✾┋. *_ʜɪᴅᴇᴛᴀɢ_*
‎*┇*✾┋. *_ʀᴇᴠᴏᴋᴇ_*
‎*┇*✾┋. *_ɪɴᴠɪᴛᴇ_*
‎*┇*✾┋. *_ᴏɴʟɪɴᴇ_*
‎*┇*✾┋. *_ᴠᴄғ_*
‎*┇*✾┋. *_ᴅᴇʟ_*
‎*┇*✾┋. *_ᴊᴏɪɴ_*
‎*┇*✾┋. *_ᴛᴏᴘᴀᴄᴛɪᴠᴇ_*
‎*┇*✾┋. *_ᴀᴅᴅ_*
‎*┇*✾┋. *_ɢᴇᴛɢᴘᴘ_*
‎*┇*✾╰┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊷
‎*╰┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊰*`,
        button: {
          text: "𝗖𝗛𝗔𝗡𝗡𝗘𝗟",
          url: "https://whatsapp.com/channel/0029VbAkAEhCRs1g8MmyEJ2K"
        },
        image: "https://eliteprotech-url.zone.id/1783842644515tugmfr.jpg"
      },

      {
        title: "*_OTHER_*",
        desc: `
‎*╭┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊰*
‎*┋*✾╭┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊷
‎*┋*✾┋⚘┋❀┋⚘┋✾┋⚘┋✾┋
‎*┋*✾┋⚘┋❀┋⚘┋✾┋⚘┋  🅡⃞
‎*┋*✾┋⚘┋❀┋⚘┋✾┋  🅔⃞  
‎*┋*✾┋⚘┋❀┋⚘┋   🅔⃞ 
‎*┋*✾┋⚘┋❀┋  🅓⃞
‎*┋*✾┋⚘┋   🅐⃞             
‎*┋*✾┋  🅠⃞        
‎*┋*✾┋         
‎*┋*✾┋ *᛭┉┉┉┈┈┈┈┈┈┉┉┉᛭*
‎*┇*✾┋🌼󟀠⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ *_𝙾𝚃𝙷𝙴𝚁_*  ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟ ⃟🌼
‎*┇*✾┋ *᛭┉┉┉┈┈┈┈┈┈┉┉┉᛭*
‎*┇*✾┋. *_ᴛɪᴍᴇɴᴏᴡ_*
‎*┇*✾┋. *_ᴄᴀʟᴄᴜʟᴀᴛᴇ_*
‎*┇*✾┋. *_ᴄᴏᴜɴᴛ_*
‎*┇*✾┋. *_ᴡᴇᴀᴛʜᴇʀ_* 
‎*┇*✾┋. *_ғᴀᴄᴛ_*
‎*┇*✾┋. *_ɴᴇᴡs_* 
‎*┇*✾┋. *_ᴅᴇғɪɴᴇ_*
‎*┇*✾┋. *_ғᴀɴᴄʏ_*
‎*┇*✾┋. *_ᴘᴀɪʀ_*
‎*┇*✾┋. *_sʀᴇᴘᴏ_*
‎*┇*✾┋. *_sᴀᴠᴇ_*
‎*┇*✾┋. *_ʀᴄᴏʟᴏʀ_*
‎*┇*✾┋. *_ᴍᴏᴠɪᴇ_*
‎*┇*✾┋. *_ʀᴏʟʟ_*
‎*┇*✾┋. *_ɢɪᴛʜᴜʙsᴛᴀʟᴋ_*
‎*┇*✾┋. *_ᴍᴇɴᴜ_*
‎*┇*✾┋. *_ʟᴏɢᴏᴍᴇɴᴜ_*
‎*┇*✾┋. *_ɢɪɴғᴏ_*
‎*┇*✾╰┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊷
‎*╰┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉━┈⊰*`,
        button: {
          text: "𝗖𝗛𝗔𝗡𝗡𝗘𝗟",
          url: "https://whatsapp.com/channel/0029VbAkAEhCRs1g8MmyEJ2K"
        },
        image: "https://eliteprotech-url.zone.id/1783842644515tugmfr.jpg"
      }
    ];

    const cards = [];
    for (let i = 0; i < categories.length; i++) {
      const item = categories[i];

      const img = (await generateWAMessageContent(
        { image: { url: item.image } },
        { upload: conn.waUploadToServer }
      )).imageMessage;

      cards.push({
        header: { title: item.title, hasMediaAttachment: true, imageMessage: img },
        body: { text: item.desc },
        footer: { text: `📖 Page ${i + 1} of ${categories.length}` },
        nativeFlowMessage: {
          buttons: [{
            name: "cta_url",
            buttonParamsJson: JSON.stringify({
              display_text: item.button.text,
              url: item.button.url,
              merchant_url: item.button.url
            })
          }]
        }
      });
    }

    const msg = generateWAMessageFromContent(
      from,
      {
        viewOnceMessage: {
          message: {
            interactiveMessage: {
              body: { text: "⿻l ꙰❀ ǫᴀᴅᴇᴇʀ | ʀᴀʜᴍᴀɴ ❀ ꙰⿻" },
              footer: { text: "Swipe ⬅️➡️ to explore all commands" },
              carouselMessage: { cards }
            }
          }
        }
      },
      { quoted: mek }
    );

    await conn.relayMessage(from, msg.message, {
      messageId: msg.key.id
    });

  } catch (e) {
    console.error("MENU ERROR:", e);
    reply("❌ Menu load nahi ho saka");
  }
});
